package com.manonline.examples.threading.basic;

/**
 * Created by davidqi on 2/9/17.
 * 线程本身并不直接与主内存进行数据的交互，而是通过线程的工作内存来完成相应的操作。这也是导致线程间数据不可见的本质原因。
 * ======================
 * 通常的工作方式
 * 线程开始 : load (从主内存中拷贝变量的值到线程内存)
 * 线程运行 : use (使用), assign (赋值), store (线程内存)
 * 线程退出 : write (线程中的值写回主内存)
 * ======================
 * 对volatile变量的
 * 写操作与普通变量的主要区别有两点：
 * 1. 修改volatile变量时（注意线程工作内存中的）会强制将修改后的值刷新的主内存中。
 * 2. 修改volatile变量后会导致其他线程工作内存中对应的变量值失效。因此，再读取该变量值的时候就需要重新从读取主内存中的值。
 * 3. happen-before 还会导致，线程2中的已改动的数据被冲掉
 */
public class VolatileTest {

}
